In [2]:
import pandas as pd
import numpy as np

Creation d'un dataframe

In [3]:
data = {'Nom': ['Alice', 'Bob', 'Charlie'],
        'Âge': [25, 30, 45],
        'Ville': ['Paris', 'New York', 'Londres']}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

       Nom  Âge     Ville
0    Alice   25     Paris
1      Bob   30  New York
2  Charlie   45   Londres

In [6]:
df["Salaire"] = [50000,60000,42000] #ajout d"une nouvelle colonne

In [7]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

Legere analyse

In [8]:
df.shape # permet de connaitre le nombre de lignes et de colonnes

(3, 4)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nom      3 non-null      object
 1   Âge      3 non-null      int64
 2   Ville    3 non-null      object
 3   Salaire  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [9]:
df.describe() # avoir des infos sur les valeurs numeriques

             Âge       Salaire
count   3.000000      3.000000
mean   33.333333  50666.666667
std    10.408330   9018.499506
min    25.000000  42000.000000
25%    27.500000  46000.000000
50%    30.000000  50000.000000
75%    37.500000  55000.000000
max    45.000000  60000.000000

In [10]:
df.isna() # renvoi un TRUE uniquement aux endroits ou il y a des valeurs NULL

     Nom    Âge  Ville  Salaire
0  False  False  False    False
1  False  False  False    False
2  False  False  False    False

In [11]:
df.isna().sum()

Nom        0
Âge        0
Ville      0
Salaire    0
dtype: int64

In [12]:
df.head(1) #pour pouvoir afficher les X premieres valeurs de votre dataframe

     Nom  Âge  Ville  Salaire
0  Alice   25  Paris    50000

In [13]:
df.tail(1) #pour pouvoir afficher les X dernieres valeurs de votre dataframe

       Nom  Âge    Ville  Salaire
2  Charlie   45  Londres    42000

In [14]:
print(df['Nom']) # avoir acces à une seule colonne

0      Alice
1        Bob
2    Charlie
Name: Nom, dtype: object

In [15]:
df

       Nom  Âge     Ville  Salaire
0    Alice   25     Paris    50000
1      Bob   30  New York    60000
2  Charlie   45   Londres    42000

In [16]:
#casting de la colonne SALAIRE EN FLOAT 
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nom      3 non-null      object
 1   Âge      3 non-null      int64
 2   Ville    3 non-null      object
 3   Salaire  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes
None

In [17]:
df.Salaire #acceder aux elements de la colonne df['Salaire']

0    50000
1    60000
2    42000
Name: Salaire, dtype: int64

In [18]:
df.Salaire = df.Salaire.astype(float) #casting

In [19]:
print(df.info())# casting done

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nom      3 non-null      object
 1   Âge      3 non-null      int64
 2   Ville    3 non-null      object
 3   Salaire  3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes
None

In [20]:
df

       Nom  Âge     Ville  Salaire
0    Alice   25     Paris  50000.0
1      Bob   30  New York  60000.0
2  Charlie   45   Londres  42000.0

In [21]:
# filtrage de la data EN CREANT UN NOUVEAU DATAFRAME
jeunes_personnes = df[df['Âge']<30]
jeunes_personnes

     Nom  Âge  Ville  Salaire
0  Alice   25  Paris  50000.0

In [22]:
df_tri = df.sort_values(by="Âge",ascending=False)
df_tri

       Nom  Âge     Ville  Salaire
2  Charlie   45   Londres  42000.0
1      Bob   30  New York  60000.0
0    Alice   25     Paris  50000.0

In [23]:
moyenne_age_par_ville = df.groupby('Ville')['Âge'].mean()
moyenne_age_par_ville

Ville
Londres     45.0
New York    30.0
Paris       25.0
Name: Âge, dtype: float64

In [24]:
df.drop('Ville', axis=1,inplace=True) #inplace sauvegarde la suppresion sans la creation de variable

In [25]:
df

       Nom  Âge  Salaire
0    Alice   25  50000.0
1      Bob   30  60000.0
2  Charlie   45  42000.0

In [27]:
#Renommage des colonnes
df = df.rename(columns={'Âge': 'Age'})

In [28]:
df

       Nom  Age  Salaire
0    Alice   25  50000.0
1      Bob   30  60000.0
2  Charlie   45  42000.0

In [29]:
df['Salaire'] = df['Salaire'].replace(50000.0,70000.0)

In [31]:
df['Salaire'] = df['Salaire']*2

In [33]:
df

       Nom  Age   Salaire
0    Alice   25  140000.0
1      Bob   30  120000.0
2  Charlie   45   84000.0

In [34]:
print('Moyenne des salaires ',df.Salaire.mean())
print('Max des salaires ',df.Salaire.max())
print('Min des salaires ',df.Salaire.min())

Moyenne des salaires  114666.66666666667
Max des salaires  140000.0
Min des salaires  84000.0

In [38]:
df['NOM'] = df.Nom.str.upper()

In [41]:
df.columns

Index(['Nom', 'Age', 'Salaire', 'NOM'], dtype='object')

In [45]:
#placer dans l'ordre de notre choix

df = df[['NOM','Nom','Age','Salaire']]
df

       NOM      Nom  Age   Salaire
0    ALICE    Alice   25  140000.0
1      BOB      Bob   30  120000.0
2  CHARLIE  Charlie   45   84000.0

In [46]:
new_df = df[["NOM","Age"]]
new_df#sous selection (subset)

       NOM  Age
0    ALICE   25
1      BOB   30
2  CHARLIE   45

In [47]:
df.to_csv("monfichier.csv") #export du fichier


Ajout de colonne date

In [48]:
df['Date'] = pd.to_datetime(['2024-01-01', '2024-02-01', '2024-03-01'])

In [49]:
df

       NOM      Nom  Age   Salaire       Date
0    ALICE    Alice   25  140000.0 2024-01-01
1      BOB      Bob   30  120000.0 2024-02-01
2  CHARLIE  Charlie   45   84000.0 2024-03-01

In [50]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NOM      3 non-null      object
 1   Nom      3 non-null      object
 2   Age      3 non-null      int64
 3   Salaire  3 non-null      float64
 4   Date     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 248.0+ bytes
None

In [52]:
date_filtre = df[df['Date'] > '2024-02-01'] # trier par rapport à une date
date_filtre

       NOM      Nom  Age  Salaire       Date
2  CHARLIE  Charlie   45  84000.0 2024-03-01

In [59]:
df ['Annee'] = df.Date.dt.year
df ['Mois'] = df.Date.dt.month
df ['Jour'] = df.Date.dt.day
df ['Semaine'] = df.Date.dt.week

/var/folders/g2/9rjw8rxj2pgc17jthk6k1jnc0000gn/T/ipykernel_14217/1568651799.py:4: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df ['Semaine'] = df.Date.dt.week

In [58]:
df

       NOM      Nom  Age   Salaire       Date  Annee  Mois  Jour  Semaine
0    ALICE    Alice   25  140000.0 2024-01-01   2024     1     1        1
1      BOB      Bob   30  120000.0 2024-02-01   2024     2     1        5
2  CHARLIE  Charlie   45   84000.0 2024-03-01   2024     3     1        9

In [60]:
df['Pays'] = ['France','France','USA']
df

,NOM,Nom,Age,Salaire,Date,Annee,Mois,Jour,Semaine,Pays
0,ALICE,Alice,25,140000.0,2024-01-01,2024,1,1,1,France
1,BOB,Bob,30,120000.0,2024-02-01,2024,2,1,5,France
2,CHARLIE,Charlie,45,84000.0,2024-03-01,2024,3,1,9,USA

In [61]:
df.Pays.value_counts() #compter le nombre d'occurences

France    2
USA       1
Name: Pays, dtype: int64

In [63]:
df.Pays.unique() # me donne les valeurs uniques de cette colonne

array(['France', 'USA'], dtype=object)

In [65]:
df.Pays.nunique() #me donne les nb valeurs uniques de cette colonne

2

In [68]:
df_trie = df.sort_values(by='Date',ascending=False) #trier le dataframe
df_trie

,NOM,Nom,Age,Salaire,Date,Annee,Mois,Jour,Semaine,Pays
2,CHARLIE,Charlie,45,84000.0,2024-03-01,2024,3,1,9,USA
1,BOB,Bob,30,120000.0,2024-02-01,2024,2,1,5,France
0,ALICE,Alice,25,140000.0,2024-01-01,2024,1,1,1,France

In [69]:
df['Differences_jours'] = (df['Date'] - pd.to_datetime('2024-01-01')).dt.days

In [70]:
df

,NOM,Nom,Age,Salaire,Date,Annee,Mois,Jour,Semaine,Pays,Differences_jours
0,ALICE,Alice,25,140000.0,2024-01-01,2024,1,1,1,France,0
1,BOB,Bob,30,120000.0,2024-02-01,2024,2,1,5,France,31
2,CHARLIE,Charlie,45,84000.0,2024-03-01,2024,3,1,9,USA,60